In [1]:
import numpy as np
import pandas as pd

In [2]:
ser = pd.Series(['a','b','c','d'])
ser

0    a
1    b
2    c
3    d
dtype: object

In [3]:
hello = [1,2,3,4]
ser1 = pd.Series(hello, index = ['A','B','C','D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [4]:
ser[0]

'a'

In [5]:
ser1['A']

1

In [6]:
ser1[["A","C"]]

A    1
C    3
dtype: int64

In [7]:
ser1[ser1>2]

C    3
D    4
dtype: int64

In [8]:
ser1*5

A     5
B    10
C    15
D    20
dtype: int64

In [9]:
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [10]:
exp1 = np.exp(ser1)
exp1

A     2.718282
B     7.389056
C    20.085537
D    54.598150
dtype: float64

In [11]:
np.log(ser1)

A    0.000000
B    0.693147
C    1.098612
D    1.386294
dtype: float64

In [12]:
np.log(exp1)

A    1.0
B    2.0
C    3.0
D    4.0
dtype: float64

In [13]:
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [14]:
ser2 = pd.Series([1,2,3,4])

In [15]:
ser2

0    1
1    2
2    3
3    4
dtype: int64

In [16]:
0 in ser2

True

In [17]:
data = {"Name":"Suban", "Key":15}

In [18]:
pd.Series(data, name = "Data")

Name    Suban
Key        15
Name: Data, dtype: object

In [19]:
student = ["Name","Age","Qualification"]

In [20]:
ser3 = pd.Series(data, index = student)

In [21]:
pd.isnull(ser3)

Name             False
Age               True
Qualification     True
dtype: bool

In [22]:
pd.notnull(ser3)

Name              True
Age              False
Qualification    False
dtype: bool

In [23]:
data2 = {"Dmk": 35000, "Ktm": 71000, "Dharan": 150000, "Itahari": 50000, "Biratnagar": 10500}

In [24]:
city = pd.Series(data2)
city

Dmk            35000
Ktm            71000
Dharan        150000
Itahari        50000
Biratnagar     10500
dtype: int64

In [25]:
district = ["Jhapa", "Illam","Dharan"]
obj = pd.Series(city, index = district)
obj

Jhapa          NaN
Illam          NaN
Dharan    150000.0
dtype: float64

In [26]:
obj2 = city + obj

In [27]:
obj2.name = "Place"

In [28]:
obj2

Biratnagar         NaN
Dharan        300000.0
Dmk                NaN
Illam              NaN
Itahari            NaN
Jhapa              NaN
Ktm                NaN
Name: Place, dtype: float64

In [29]:
obj2.index.name = "Address"
obj2

Address
Biratnagar         NaN
Dharan        300000.0
Dmk                NaN
Illam              NaN
Itahari            NaN
Jhapa              NaN
Ktm                NaN
Name: Place, dtype: float64

In [30]:
obj2.index = ["Damak","Dharan","Kathmandu","Lumbini","Itahari","Illam","Brtnagar"]
obj2

Damak             NaN
Dharan       300000.0
Kathmandu         NaN
Lumbini           NaN
Itahari           NaN
Illam             NaN
Brtnagar          NaN
Name: Place, dtype: float64

In [31]:
dropping = pd.Series(np.arange(7),index = list("abcdefg"))

In [32]:
dropping

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int32

In [33]:
dropping.drop('g',inplace = True)

In [34]:
dropping

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int32

In [35]:
dropping.drop(["a", "e"])

b    1
c    2
d    3
f    5
dtype: int32

In [36]:
dropping

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int32

In [37]:
dropping ["b"]

1

In [38]:
dropping[["a","c"]]

a    0
c    2
dtype: int32

In [39]:
dropping["a":"c"]

a    0
b    1
c    2
dtype: int32

In [40]:
dropping[-1:]

f    5
dtype: int32

In [41]:
dropping[::-1]

f    5
e    4
d    3
c    2
b    1
a    0
dtype: int32

In [42]:
dropping[[1,3]]

b    1
d    3
dtype: int32

In [43]:
dropping[dropping<4]

a    0
b    1
c    2
d    3
dtype: int32

In [44]:
dropping["a","b"]=3

In [45]:
dropping

a    3
b    3
c    2
d    3
e    4
f    5
dtype: int32

In [46]:
dataframe = {"Name":["Aba","Ama","Ank","Ari"],
             "Age":[1,2,3,4],
             "Qual":['Grad','+2','SEE','9']}

In [47]:
pd.DataFrame(dataframe)

  Name  Age  Qual
0  Aba    1  Grad
1  Ama    2    +2
2  Ank    3   SEE
3  Ari    4     9

In [48]:
df = pd.DataFrame(dataframe, columns=["Age","Name","Qual"])

In [49]:
df

   Age Name  Qual
0    1  Aba  Grad
1    2  Ama    +2
2    3  Ank   SEE
3    4  Ari     9

In [50]:
df2 = pd.DataFrame(dataframe, columns = ['Age', 'Name', 'C','Qual'])

In [51]:
df2

   Age Name    C  Qual
0    1  Aba  NaN  Grad
1    2  Ama  NaN    +2
2    3  Ank  NaN   SEE
3    4  Ari  NaN     9

In [52]:
df2.columns

Index(['Age', 'Name', 'C', 'Qual'], dtype='object')

In [53]:
df2[["Name","C"]]

  Name    C
0  Aba  NaN
1  Ama  NaN
2  Ank  NaN
3  Ari  NaN

In [54]:
df2.Name

0    Aba
1    Ama
2    Ank
3    Ari
Name: Name, dtype: object

In [55]:
df2.C

0    NaN
1    NaN
2    NaN
3    NaN
Name: C, dtype: object

In [56]:
df2.Age

0    1
1    2
2    3
3    4
Name: Age, dtype: int64

In [57]:
df2

   Age Name    C  Qual
0    1  Aba  NaN  Grad
1    2  Ama  NaN    +2
2    3  Ank  NaN   SEE
3    4  Ari  NaN     9

In [58]:
df2.loc[1]

Age       2
Name    Ama
C       NaN
Qual     +2
Name: 1, dtype: object

In [59]:
df2.loc[1:3]

   Age Name    C Qual
1    2  Ama  NaN   +2
2    3  Ank  NaN  SEE
3    4  Ari  NaN    9

In [60]:
df2.loc[[0,3],["Age","Qual",'C']]

   Age  Qual    C
0    1  Grad  NaN
3    4     9  NaN

In [61]:
df2.loc[:,["Age"]]

   Age
0    1
1    2
2    3
3    4

In [62]:
df2.iloc[1:3,0:2]

   Age Name
1    2  Ama
2    3  Ank

In [63]:
df2.iloc[[1,2,3],[0,1]]

   Age Name
1    2  Ama
2    3  Ank
3    4  Ari

In [64]:
df2["C"] ="Grade"

In [65]:
df2

   Age Name      C  Qual
0    1  Aba  Grade  Grad
1    2  Ama  Grade    +2
2    3  Ank  Grade   SEE
3    4  Ari  Grade     9

In [66]:
df2["Income"] = np.NaN

In [67]:
df2["Income"] = [5000, 5050,6000,7890]
df2

   Age Name      C  Qual  Income
0    1  Aba  Grade  Grad    5000
1    2  Ama  Grade    +2    5050
2    3  Ank  Grade   SEE    6000
3    4  Ari  Grade     9    7890

In [68]:
df2["profession"] = ['Intern','Student','Engineer','Student']

In [69]:
df2

   Age Name      C  Qual  Income profession
0    1  Aba  Grade  Grad    5000     Intern
1    2  Ama  Grade    +2    5050    Student
2    3  Ank  Grade   SEE    6000   Engineer
3    4  Ari  Grade     9    7890    Student

In [70]:
del df2["C"]
df2

   Age Name  Qual  Income profession
0    1  Aba  Grad    5000     Intern
1    2  Ama    +2    5050    Student
2    3  Ank   SEE    6000   Engineer
3    4  Ari     9    7890    Student

In [71]:
dictionary = {'Name':{'Hash':2063,"Alu":2061,"Dal":2065},
              "Age":{'Hash':15}}

In [72]:
df3 = pd.DataFrame(dictionary)

In [73]:
df3

      Name   Age
Hash  2063  15.0
Alu   2061   NaN
Dal   2065   NaN

In [74]:
df3.T

        Hash     Alu     Dal
Name  2063.0  2061.0  2065.0
Age     15.0     NaN     NaN

In [75]:
df3.index.name = "Name"

In [76]:
df3

      Name   Age
Name
Hash  2063  15.0
Alu   2061   NaN
Dal   2065   NaN

In [77]:
df3.columns.name="Description"

In [78]:
df3

Description  Name   Age
Name
Hash         2063  15.0
Alu          2061   NaN
Dal          2065   NaN

In [79]:
df3.columns

Index(['Name', 'Age'], dtype='object', name='Description')

In [80]:
df3.values

array([[2063.,   15.],
       [2061.,   nan],
       [2065.,   nan]])

In [81]:
df3['Name'].unique

<bound method Series.unique of Name
Hash    2063
Alu     2061
Dal     2065
Name: Name, dtype: int64>

In [82]:
df3['Age'].unique()

array([15., nan])

In [83]:
a = pd.Series([1,2,3,4], index =list("abcd"))

In [84]:
a

a    1
b    2
c    3
d    4
dtype: int64

In [85]:
a_rindex = a.reindex(list("abcdef"))

In [86]:
a_rindex

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
f    NaN
dtype: float64

In [87]:
color = pd.Series(["a","b","c","d"], index = [0,2,3,4])
color1 = pd.Series(["a","b","c","d"], index = [0,2,3,4])

In [88]:
color

0    a
2    b
3    c
4    d
dtype: object

In [89]:
color = color.reindex(range(6),method = 'ffill')

In [90]:
color

0    a
1    a
2    b
3    c
4    d
5    d
dtype: object

In [91]:
color1 = color1.reindex(range(6), method = 'bfill')

In [92]:
color1

0      a
1      b
2      b
3      c
4      d
5    NaN
dtype: object

In [135]:
df = pd.DataFrame(np.arange(9).reshape(3,3), index = list("abc"), columns = [["N","U","M"]])

In [136]:
df

   N  U  M
a  0  1  2
b  3  4  5
c  6  7  8

In [137]:
df1 = df.reindex(list("abcd"))

In [138]:
df1

     N    U    M
a  0.0  1.0  2.0
b  3.0  4.0  5.0
c  6.0  7.0  8.0
d  NaN  NaN  NaN

In [139]:
ind = [["N","B","R"]]

In [140]:
df1.reindex(columns = ind)

     N   B   R
a  0.0 NaN NaN
b  3.0 NaN NaN
c  6.0 NaN NaN
d  NaN NaN NaN

In [141]:
df1

     N    U    M
a  0.0  1.0  2.0
b  3.0  4.0  5.0
c  6.0  7.0  8.0
d  NaN  NaN  NaN

In [142]:
df3 = df.reindex(list("adcb"),columns = ind)

In [143]:
df3

     N   B   R
a  0.0 NaN NaN
d  NaN NaN NaN
c  6.0 NaN NaN
b  3.0 NaN NaN

In [144]:
df

   N  U  M
a  0  1  2
b  3  4  5
c  6  7  8

In [145]:
city = ["DMK", "New", "KTM"]

In [146]:
df = pd.DataFrame(np.arange(16).reshape(4,4), index = list("1234"), columns = ["N","U","M","B"])

In [147]:
df.name = "Numbers"

In [148]:
df.index.name = "Number"

In [149]:
df

         N   U   M   B
Number
1        0   1   2   3
2        4   5   6   7
3        8   9  10  11
4       12  13  14  15

In [150]:
series = pd.Series(np.arange(10), index = list("abcdefghij"))

In [151]:
series

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int32

In [152]:
series.name = "Numbers"

In [153]:
series

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
Name: Numbers, dtype: int32

In [154]:
df.loc["1"]

N    0
U    1
M    2
B    3
Name: 1, dtype: int32

In [155]:
df.T

Number  1  2   3   4
N       0  4   8  12
U       1  5   9  13
M       2  6  10  14
B       3  7  11  15

In [158]:
df_ = pd.DataFrame(np.arange(9).reshape(3,3), index = [1,9,2], columns = ["N","U","M"])

In [160]:
df_

   N  U  M
1  0  1  2
9  3  4  5
2  6  7  8

In [165]:
df_.loc[1:,["N","M"]]

   N  M
1  0  2
9  3  5
2  6  8

In [169]:
df_.drop(9)

   N  U  M
1  0  1  2
2  6  7  8

In [171]:
df_.drop("U", axis = 1)

   N  M
1  0  2
9  3  5
2  6  8

In [172]:
df_

   N  U  M
1  0  1  2
9  3  4  5
2  6  7  8

In [174]:
df_.drop(9, axis = 0, inplace = True)

In [175]:
df_

   N  U  M
1  0  1  2
2  6  7  8

In [176]:
data = pd.DataFrame(np.arange(25).reshape(5,5), columns = ["A","B","C","D","E"], index = [1,2,3,4,5])

In [177]:
data

    A   B   C   D   E
1   0   1   2   3   4
2   5   6   7   8   9
3  10  11  12  13  14
4  15  16  17  18  19
5  20  21  22  23  24

In [179]:
data[["A","D"]]

    A   D
1   0   3
2   5   8
3  10  13
4  15  18
5  20  23

In [180]:
data[:3]

    A   B   C   D   E
1   0   1   2   3   4
2   5   6   7   8   9
3  10  11  12  13  14

In [183]:
data[data["C"]>=12]

    A   B   C   D   E
3  10  11  12  13  14
4  15  16  17  18  19
5  20  21  22  23  24

In [187]:
data<13

       A      B      C      D      E
1   True   True   True   True   True
2   True   True   True   True   True
3   True   True   True  False  False
4  False  False  False  False  False
5  False  False  False  False  False

In [190]:
data[data<=13] = 1

In [191]:
data

    A   B   C   D   E
1   1   1   1   1   1
2   1   1   1   1   1
3   1   1   1   1  14
4  15  16  17  18  19
5  20  21  22  23  24

In [192]:
ser = pd.Series(np.arange(4))

In [193]:
ser

0    0
1    1
2    2
3    3
dtype: int32

In [194]:
ser[1]

1

In [195]:
ser[:2]

0    0
1    1
dtype: int32

In [196]:
ser.loc[:2]

0    0
1    1
2    2
dtype: int32

In [197]:
ser.iloc[-1]

3

In [199]:
ser.loc[1]

1

In [200]:
ser.iloc[-3:-1]

1    1
2    2
dtype: int32

In [203]:
ser2 = pd.Series(np.arange(4), index = list  ("abcd"))